In [ ]:
#!pip install pandas
#!pip install faker

In [71]:
import sqlite3
from faker import Faker
from random import randint, choice
import pandas as pd

In [9]:
fake = Faker('pt_BR')

# Conectando e entendendo o banco criado pelo Django

In [98]:
conn = sqlite3.connect('db.sqlite3')

In [99]:
cur = conn.cursor()

## Vendo os nomes das tabelas que o Django criou

In [100]:
query = '''
SELECT name
FROM sqlite_master 
WHERE type ='table' AND name NOT LIKE 'sqlite_%';
'''

cur.execute(query)
for c in cur.fetchall():
    print(c)

('django_migrations',)
('auth_group_permissions',)
('auth_user_groups',)
('auth_user_user_permissions',)
('django_admin_log',)
('django_content_type',)
('auth_permission',)
('auth_group',)
('auth_user',)
('pages_interesses',)
('django_session',)
('pages_aluno',)
('pages_aluno_interesses',)

## Acessando cada tabela

In [17]:
df = pd.read_sql_query('SELECT * FROM pages_interesses', conn)
df.head()

   id categoria  grau    nome
0   1      Arte     1  Música
1   2      Arte     2  Música

In [18]:
df = pd.read_sql_query('SELECT * FROM pages_aluno', conn)
df.head()

,id,nome,idade,sexo,curso,periodo
0,1,Cristiano Larréa,20,M,Ciência de Dados e Inteligência Artificial,2

In [19]:
df = pd.read_sql_query('SELECT * FROM pages_aluno_interesses', conn)
df.head()

   id  aluno_id  interesses_id
0   1         1              1

## Zerando os dados das tabelas

In [165]:
cur.execute('DELETE FROM pages_interesses')
cur.execute('DELETE FROM pages_aluno')
cur.execute('DELETE FROM pages_aluno_interesses')

In [166]:
cur.execute("SELECT * FROM pages_aluno")
for c in cur.fetchmany(15):
    print(c)

In [167]:
cur.execute("SELECT * FROM pages_interesses")
for c in cur.fetchmany(15):
    print(c)

In [168]:
cur.execute("SELECT * FROM pages_aluno_interesses")
for c in cur.fetchmany(15):
    print(c)

# Criando dados fakes

## Tabela pages_interesses

In [137]:
categorias = []
categorias.extend(['Arte']*6)
categorias.extend(['Esporte']*10)
categorias.extend(['Entretenimento']*5)
categorias.extend(['Estilos de Música']*12)
categorias.extend(['Social']*9)

In [138]:
nomes = ['Musica', 'Dança', 'Literatura', 'Museu', 'Cinema', 'Teatro',
'Xadrez', 'Volei', 'Futebol', 'Handbol', 'Basquete', 'Tenis de Mesa', 'Natação', 'Crossfit', 'Musculação', 'Golfe',
'Jogos', 'Séries', 'Filmes', 'Novelas', 'Livros',
'Pop', 'Samba', 'Pagode', 'Sertanejo', 'R&B', 'Jazz', 'Blues', 'Piseiro', 'KPOP', 'Funk', 'Rap', 'Trap',
'Festas', 'Boate', 'Churrasco', 'Roda de Samba', 'Passeio no Parque', 'Praia', 'Trilha', 'Piquenique', 'Montanhas']

In [139]:
graus = []
graus.extend([1]*42)
graus.extend([2]*42)
graus.extend([3]*42)
graus.extend([4]*42)
graus.extend([5]*42)

In [140]:
ids = range(1,211)

In [141]:
categorias.extend(categorias*4)
nomes.extend(nomes*4)

In [142]:
interesses = {
    'id': ids,
    'categoria': categorias,
    'grau': graus,
    'nome': nomes
}
df_int = pd.DataFrame(interesses)

In [143]:
df_int

      id categoria  grau               nome
0      1      Arte     1             Musica
1      2      Arte     1              Dança
2      3      Arte     1         Literatura
3      4      Arte     1              Museu
4      5      Arte     1             Cinema
..   ...       ...   ...                ...
205  206    Social     5  Passeio no Parque
206  207    Social     5              Praia
207  208    Social     5             Trilha
208  209    Social     5         Piquenique
209  210    Social     5          Montanhas

[210 rows x 4 columns]

## Tabela pages_alunos

In [144]:
alunos = {
    'id': [],
    'nome':[],
    'idade':[],
    'sexo':[],
    'curso':[],
    'periodo':[]
}


for id in range(1,401):
    alunos['id'].append(id)
    alunos['nome'].append(fake.name())
    alunos['idade'].append(randint(15,50))
    alunos['sexo'].append(choice(['M','F']))
    alunos['curso'].append(choice(['Ciência de Dados e Inteligência Artificial', 'Matemática Aplicada']))
    alunos['periodo'].append(randint(1,8))

In [145]:
df_alunos = pd.DataFrame(alunos)

In [146]:
df_alunos

,id,nome,idade,sexo,curso,periodo
0,1,Bianca Cardoso,20,F,Ciência de Dados e Inteligência Artificial,2
1,2,Cauê Moraes,18,M,Matemática Aplicada,2
2,3,Milena da Costa,17,F,Matemática Aplicada,4
3,4,Daniela Correia,46,F,Ciência de Dados e Inteligência Artificial,6
4,5,Maria Luiza Ferreira,29,F,Ciência de Dados e Inteligência Artificial,2
...,...,...,...,...,...,...
395,396,Julia Castro,28,F,Matemática Aplicada,1
396,397,Davi Luiz Silveira,29,F,Matemática Aplicada,4
397,398,Lorenzo Costela,41,F,Ciência de Dados e Inteligência Artificial,3
398,399,Ana Júlia Caldeira,43,F,Matemática Aplicada,4
399,400,Henrique da Mata,48,F,Matemática Aplicada,3

## Tabela pages_interesses_alunos

In [147]:
aluno_interesses = {
    'id': [],
    'aluno_id': [],
    'interesses_id': []
}

In [148]:
for id in range(1, 1501):
    aluno_interesses['id'].append(id),
    aluno_interesses['aluno_id'].append(randint(1,400)),
    aluno_interesses['interesses_id'].append(randint(1,210))

In [149]:
df_alunos_interesses = pd.DataFrame(aluno_interesses)
df_alunos_interesses

        id  aluno_id  interesses_id
0        1       220             26
1        2        72            151
2        3       103             57
3        4       329             92
4        5       286             13
...    ...       ...            ...
1495  1496       254            191
1496  1497         4            185
1497  1498       156             84
1498  1499       168            108
1499  1500       252            112

[1500 rows x 3 columns]

# Registrando dados no banco

In [169]:
data_int = []
for i in range(0,len(df_int)):
    tuple = (int(df_int['id'][i]), str(df_int['categoria'][i]), int(df_int['grau'][i]), (str(df_int['nome'][i])))
    data_int.append(tuple)

In [170]:
cur.executemany('INSERT INTO pages_interesses VALUES (?,?,?,?)', data_int)

In [171]:
cur.execute("SELECT * FROM pages_interesses")
for c in cur.fetchmany(15):
    print(c)

(1, 'Arte', 1, 'Musica')
(2, 'Arte', 1, 'Dança')
(3, 'Arte', 1, 'Literatura')
(4, 'Arte', 1, 'Museu')
(5, 'Arte', 1, 'Cinema')
(6, 'Arte', 1, 'Teatro')
(7, 'Esporte', 1, 'Xadrez')
(8, 'Esporte', 1, 'Volei')
(9, 'Esporte', 1, 'Futebol')
(10, 'Esporte', 1, 'Handbol')
(11, 'Esporte', 1, 'Basquete')
(12, 'Esporte', 1, 'Tenis de Mesa')
(13, 'Esporte', 1, 'Natação')
(14, 'Esporte', 1, 'Crossfit')
(15, 'Esporte', 1, 'Musculação')

In [172]:
data_alunos = []
for i in range(0,len(df_alunos)):
    tuple = (int(df_alunos['id'][i]), str(df_alunos['nome'][i]), str(df_alunos['sexo'][i]), int(df_alunos['idade'][i]), str(df_alunos['curso'][i]), int(df_alunos['periodo'][i]))
    data_alunos.append(tuple)

In [173]:
cur.executemany('INSERT INTO pages_aluno VALUES (?,?,?,?,?,?)', data_alunos)

In [174]:
cur.execute("SELECT * FROM pages_aluno")
for c in cur.fetchmany(15):
    print(c)

(1, 'Bianca Cardoso', 'F', '20', 'Ciência de Dados e Inteligência Artificial', 2)
(2, 'Cauê Moraes', 'M', '18', 'Matemática Aplicada', 2)
(3, 'Milena da Costa', 'F', '17', 'Matemática Aplicada', 4)
(4, 'Daniela Correia', 'F', '46', 'Ciência de Dados e Inteligência Artificial', 6)
(5, 'Maria Luiza Ferreira', 'F', '29', 'Ciência de Dados e Inteligência Artificial', 2)
(6, 'Renan Pereira', 'M', '46', 'Matemática Aplicada', 6)
(7, 'Luiz Henrique Vieira', 'F', '42', 'Ciência de Dados e Inteligência Artificial', 5)
(8, 'Vicente Correia', 'M', '33', 'Matemática Aplicada', 1)
(9, 'Ana Vitória Lopes', 'M', '15', 'Matemática Aplicada', 4)
(10, 'Heloísa Alves', 'F', '15', 'Ciência de Dados e Inteligência Artificial', 8)
(11, 'Luiz Fernando Caldeira', 'F', '24', 'Ciência de Dados e Inteligência Artificial', 3)
(12, 'Clara Pires', 'F', '19', 'Matemática Aplicada', 4)
(13, 'Srta. Júlia Ferreira', 'F', '38', 'Matemática Aplicada', 2)
(14, 'Marcela da Rosa', 'F', '24', 'Matemática Aplicada', 7)
(15, 'Gabriel Oliveira', 'M', '16', 'Matemática Aplicada', 6)

In [175]:
data_int_alunos = []
for i in range(0,len(df_alunos_interesses)):
    tuple = (int(df_alunos_interesses['id'][i]), int(df_alunos_interesses['aluno_id'][i]), int(df_alunos_interesses['interesses_id'][i]))
    data_int_alunos.append(tuple)

In [183]:
cur.executemany('INSERT INTO pages_aluno_interesses VALUES (?,?,?)', data_int_alunos)

IntegrityError: UNIQUE constraint failed: pages_aluno_interesses.id

Está aceitando só 270 registros!

In [189]:
cur.execute("SELECT * FROM pages_aluno_interesses")
for c in cur.fetchmany(15):
    print(c)

(1, 220, 26)
(2, 72, 151)
(3, 103, 57)
(4, 329, 92)
(5, 286, 13)
(6, 234, 169)
(7, 64, 169)
(8, 66, 36)
(9, 167, 42)
(10, 59, 166)
(11, 54, 155)
(12, 218, 4)
(13, 8, 81)
(14, 253, 124)
(15, 164, 163)

## Analisando estrutura da tabela pages_aluno_interesses

In [188]:
query = '''
SELECT sql
FROM sqlite_master
WHERE name = 'pages_aluno_interesses';
'''

cur.execute(query)
for c in cur.fetchall():
    print(c[0])

CREATE TABLE "pages_aluno_interesses" ("id" integer NOT NULL PRIMARY KEY AUTOINCREMENT, "aluno_id" bigint NOT NULL REFERENCES "pages_aluno" ("id") DEFERRABLE INITIALLY DEFERRED, "interesses_id" bigint NOT NULL REFERENCES "pages_interesses" ("id") DEFERRABLE INITIALLY DEFERRED)

In [190]:
conn.close()